# hello-world-
# 关于斯诺登的自传


  首先这本书的翻译很好，这本书是本自传，阅读起来却更像一本小说，让人以一个第三人的身份去了解了作者本人的经历，毫无疑问作者的人生在大多数人看来是十分成功的,他的有趣的童年经历，成年后的工作与生活。但是还有一点，作者给我开了一扇窗，让我开始思考什么是美国式的民主自由，不同的制度环境下人格的生成将会有多大的不同，作为一个美国人，他心目中的人民与政府又是怎样的，这是另一种价值观观的告白，他是个理想主义者，为了让他的国家的普通民众了解到自己的现状，放弃了自己的一切，和阿桑奇一样，都是另一种”勇士“（这样的故事可能更像一种复杂的哲学问题，毕竟世界并不是非黑即白的）。
  
# 真实的世界与荒诞
   这本书我读的很顺畅，我跟随着作者的脚步走入他的生活，跟随他的情绪一起去经历他的人生，这也是自传的魅力所在，你可以看到别人的思想历程，毕竟人与人之间都是孤独的，自传是少有的能够让一个人去稍稍了解另一个人精神世界的的方式，当我从这个故事里抽离出来，我的第一反应可能是：这样的经历很吸引人，是一个很棒的故事，然后随即我又意识到，这个故事就发生在现实世界，他是真实存在的，你觉得有趣的情节其实就发生在你身边，然后我会有种别样的感觉，于是我开始回忆关于我所阅读的内容，从他的那个信息并未肆意生长蔓延开的童年开始，再到他跟随信息一同来到网络的新时代，在一番问题思考后，才最终做出了他自己的选择，就像我当时在新闻上看到的那样（或许不是），使得让我觉得他是某种意义上的平民英雄，或者类似屠龙勇士发现派他去屠龙的国王就是一条龙的这种荒诞桥段，或者是安徒生童话里的皇帝的新衣，然后他是那个幼稚的，开口说话的小孩。无法用对与错去评判这样的行为，只能说这是作者的选择，我很敬佩，这是我对他一方面的感受，另一方面，从这本书中，我也感受到了信息世界的另一番样貌，可能因为我们早已经习惯了，所以我们并没有太大的感觉，就像我此时此刻坐在电脑面前看着这本书，同时我的网络链接着整个世界，这本书揭露了网络信息的另一面，虽然或许我们大部分人都知道信息泄露已经是21世纪公开的秘密，但是这样的角度给了我们更多的感触。
    
# 我们的生活 
   回到自己的生活，在我的印象中，我家的第一台电脑是2007年，当时的网络和现在的面貌截然不同，信息高度自由，相应的行业也是从那个时候开始逐渐发展起来的，随着时代的发展，现在这些如同树枝层层向下蔓延的网络，已经被一个巨大的罩子盖住了，很多当时在我看来轻而易举能看到的信息现在早已经被封存不见，我们在网络上的行为在一定范围内行使着，这个时代的网络多的是各种各样的框架，为的是让这一切看上去井井有条，当今社会，网络在带给人们便利的同时，也用其巨大的联系性让世界走向另一个时代，就像此时此刻我坐在自己的房间，而我的面前放着电脑，手机，还有平板，我的父母在客厅观看着网络电视，打开软件就能通过摄像头看到门外的情景，每个人的手机上都有着各种社交软件，这就是我们现在的生活，网络究竟是交流的钥匙，还是暴政开端，我在这里注册的账号，也许会给我另一种不同的网络感受。
