# 游戏剧本：自杀者的尴尬/绝不可能的世界
### 角色情节设计之 厌世作家


*声明：
1 此角色的部分情节据当代萨满王大喜某世的真实经历改编 
2 本游戏旨在模拟自杀失败 发现自身的价值与美好 回到现实 实现生命生成的更多可能性
3 本人对这方面信息目前知之甚少 其他玩家身份（如 家庭主妇 艺术家 破产大佬 等）目前缺乏现实材料参考 无法设计 期待自行在游戏中创建身份 特别是本游戏的生命回顾模块 在某种状态下是对游戏玩家们开源的*


###### **模块一   创建角色 例如：厌世作家**

- 选项一：有所畏惧 下不了决心自杀 → 行使对自身肉体载具的权利：杀掉身体的一部分 →  转动转盘 → **陷入尴尬** ：
  - 转盘选项：十二指肠/头颅......（而实际上指针只会在这些选项上停下：
    - 头发
    - 指甲
    - ......
 → 选项按钮 ：

| 按钮1 | 按钮2 | 
| ------ | ------ | 
|返回选项 重新选择|放下自杀 进入生命回顾情节|
|红色|蓝色|
#
- 选项二：认定世界/自己没有希望 心意已决 → 身体所有创造性活动停 已有一缕魂魄离开生体 剩下的魂魄在还未杀死生体 → 玩家跟随这屡出体的魂魄游历中  → 魂魄的任务是投身下一个载具 →  **陷入尴尬** ：
  - 由于对世界感到完全无望而抛弃原有肌体 却发现怀抱这样的世界观无法找到 有意义/希望的载具  → （此处应有更多情节设计）→ 无更好的选择 回到原载具
    - 发现当代有适合自身栖息的群体意识存在 → 选择**回到原载具** 肌体恢复 现实世界中前往此地
    - 碰到同样处境的一缕魂魄 → 进入对方身体  → **开启另一种可能性**（可以体验相互的游戏身份 特别是生命回顾等模块 对彼此开源 可以进入对方创造的世界 修改完善 留下另一版本）
#
- 选项三：皈依某宗教 → ...... → 选项转盘（或跳转去模块三：公共世界模块创造新体系）  → **陷入尴尬** ：
    - 决定吃全素 沾到荤的也不行 烧过荤的锅煮出来的菜也不行 → 发现自己是荤的 无法做到食物不触碰到自己 无法控制口水的吞咽 → ...
    - 决定向佛母/圣母学习 → **返回现实生活** 找人类对象或探寻外星人等高智慧对象
    - ...
#
- 选项四：反社会行为 → 被告知 这个选项不应该在这里出现 也设计不来^_^)

#



> “身体相比大脑更接近灵魂”————查拉图斯特拉的名言 改编（尼采的原话大概是 灵魂只是身体的一部分）
***
###### **模块二     生命回顾** 
*此模块是各位玩家留在这个世界的番外板块  此过程十分艰巨却万分有益*

生命回顾 从最消耗玩家生命能量的事物开始 → 列举自己生命中绝对不可能发生的事 和世界绝对不可能变成的样子 → 生成愿望清单 一直想做但没有做的事（例如 追星 吃龙肉） → 为实现这些愿望在游戏中创造相应的世界 → 进入对方创造的世界 体验 → 创造修改完善后的副本 留在公共创造的世界板块  （和其他玩家互换一部分“魂魄”的情节 参见上文选项二末尾） → ......更多设计和支持有待我想出来 
#

***
###### **模块三     绝不可能的世界** 

此模块由各玩家创建，对所有玩家开放开源，欢迎添砖加瓦！


